export const teamPlay = [
    "소통 스타일", "협업 성향", "말하는 방식", "문제 해결방식", "MBTI"
];

export const teamPlayOptionList: { id: string; label: string }[] = [
    // 1 소통 스타일
    { id: '1-1', label: '소통스타일01' },
    { id: '1-2', label: '소통스타일02' },
    { id: '1-3', label: '소통스타일03' },
    { id: '1-4', label: '소통스타일04' },
    { id: '1-5', label: '소통스타일05' },
    { id: '1-6', label: '소통스타일06' },
    { id: '1-7', label: '소통스타일07' },
    { id: '1-8', label: '소통스타일08' },
    { id: '1-9', label: '소통스타일09' },
    { id: '1-10', label: '소통스타일10' },

    // 2 협업 성향
    { id: '2-1', label: '협업성향01' },
    { id: '2-2', label: '협업성향02' },
    { id: '2-3', label: '협업성향03' },
    { id: '2-4', label: '협업성향04' },
    { id: '2-5', label: '협업성향05' },
    { id: '2-6', label: '협업성향06' },
    { id: '2-7', label: '협업성향07' },
    { id: '2-8', label: '협업성향08' },
    { id: '2-9', label: '협업성향09' },
    { id: '2-10', label: '협업성향10' },

    // 3 일하는 방식
    { id: '3-1', label: '일하는방식01' },
    { id: '3-2', label: '일하는방식02' },
    { id: '3-3', label: '일하는방식03' },
    { id: '3-4', label: '일하는방식04' },
    { id: '3-5', label: '일하는방식05' },
    { id: '3-6', label: '일하는방식06' },
    { id: '3-7', label: '일하는방식07' },
    { id: '3-8', label: '일하는방식08' },
    { id: '3-9', label: '일하는방식09' },
    { id: '3-10', label: '일하는방식10' },

    // 4 문제 해결방식
    { id: '4-1', label: '해결방식01' },
    { id: '4-2', label: '해결방식02' },
    { id: '4-3', label: '해결방식03' },
    { id: '4-4', label: '해결방식04' },
    { id: '4-5', label: '해결방식05' },
    { id: '4-6', label: '해결방식06' },
    { id: '4-7', label: '해결방식07' },
    { id: '4-8', label: '해결방식08' },
    { id: '4-9', label: '해결방식09' },
    { id: '4-10', label: '해결방식10' },

    // 5 MBTI
    { id: '5-1', label: 'ISTJ' },
    { id: '5-2', label: 'ISFJ' },
    { id: '5-3', label: 'INFJ' },
    { id: '5-4', label: 'INTJ' },
    { id: '5-5', label: 'ISTP' },
    { id: '5-6', label: 'ISFP' },
    { id: '5-7', label: 'INFP' },
    { id: '5-8', label: 'INTP' },
    { id: '5-9', label: 'ESTP' },
    { id: '5-10', label: 'ESFP' },
    { id: '5-11', label: 'ENFP' },
    { id: '5-12', label: 'ENTP' },
    { id: '5-13', label: 'ESTJ' },
    { id: '5-14', label: 'ESFJ' },
    { id: '5-15', label: 'ENFJ' },
    { id: '5-16', label: 'ENTJ' },
    { id: '5-17', label: '모름' },
    { id: '5-18', label: '비밀' },
  ];

export const teamPlaySelectedOptionMap: Record<string, string[]> = {
    '1': ['1-1', '1-2', '1-3', '1-4', '1-5', '1-6', '1-7', '1-8', '1-9', '1-10'],
    '2': ['2-1', '2-2', '2-3', '2-4', '2-5', '2-6', '2-7', '2-8', '2-9', '2-10'],
    '3': ['3-1', '3-2', '3-3', '3-4', '3-5', '3-6', '3-7', '3-8', '3-9', '3-10'],
    '4': ['4-1', '4-2', '4-3', '4-4', '4-5', '4-6', '4-7', '4-8', '4-9', '4-10'],
    '5': ['5-1', '5-2', '5-3', '5-4', '5-5', '5-6', '5-7', '5-8', '5-9', '5-10', 
      '5-11', '5-12', '5-13', '5-14', '5-15', '5-16', '5-17', '5-18'],
  };
  